results/springboot/c6gd.xlarge/wrk2.log
===== Spring Boot Benchmark (wrk) =====
Instance Type: c6gd.xlarge
Spring Boot Host: springboot-server-c6gd-xlarge

--- Warm-up Phase (30s) ---
Warm-up complete

--- Main Page - 2 threads, 50 connections, 60s ---
Running 1m test @ http://springboot-server-c6gd-xlarge:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.86ms    0.98ms  49.83ms   90.30%
    Req/Sec    13.83k   800.39    16.20k    67.50%
  Latency Distribution
     50%    1.73ms
     75%    1.99ms
     90%    2.59ms
     99%    5.05ms
  1652103 requests in 1.00m, 220.88MB read
Requests/sec:  27525.44
Transfer/sec:      3.68MB

--- Main Page - 2 threads, 100 connections, 60s ---
Running 1m test @ http://springboot-server-c6gd-xlarge:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.33ms    1.22ms  37.12ms   79.18%
    Req/Sec    15.09k     0.97k   25.95k    71.89%
  Latency Distribution
     50%    3.23ms
     75%    3.74ms
     90%    4.69ms
     99%    6.89ms
  1801382 requests in 1.00m, 240.84MB read
Requests/sec:  29973.06
Transfer/sec:      4.01MB

--- High Load - 2 threads, 200 connections, 30s ---
Running 30s test @ http://springboot-server-c6gd-xlarge:8080/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.10ms    1.96ms  56.90ms   79.07%
    Req/Sec    16.52k     0.89k   18.40k    65.22%
  Latency Distribution
     50%    5.86ms
     75%    6.86ms
     90%    8.26ms
     99%   11.70ms
  982960 requests in 30.05s, 131.42MB read
Requests/sec:  32712.88
Transfer/sec:      4.37MB

===== Spring Boot Benchmark Complete =====